micropython/micropython/stmhal/cmsis/devinc/stm32l476xx.h
/*******************  Bit definition for EXTI_EMR2 register  ******************/
#define  EXTI_EMR2_EM32                      ((uint32_t)0x00000001U)        /*!< Event Mask on line 32 */
#define  EXTI_EMR2_EM33                      ((uint32_t)0x00000002U)        /*!< Event Mask on line 33 */
#define  EXTI_EMR2_EM34                      ((uint32_t)0x00000004U)        /*!< Event Mask on line 34 */
#define  EXTI_EMR2_EM35                      ((uint32_t)0x00000008U)        /*!< Event Mask on line 35 */
#define  EXTI_EMR2_EM36                      ((uint32_t)0x00000010U)        /*!< Event Mask on line 36 */
#define  EXTI_EMR2_EM37                      ((uint32_t)0x00000020U)        /*!< Event Mask on line 37 */
#define  EXTI_EMR2_EM38                      ((uint32_t)0x00000040U)        /*!< Event Mask on line 38 */
#define  EXTI_EMR2_EM39                      ((uint32_t)0x00000080U)        /*!< Event Mask on line 39 */

/******************  Bit definition for EXTI_RTSR2 register  ******************/
#define  EXTI_RTSR2_RT35                     ((uint32_t)0x00000008U)        /*!< Rising trigger event configuration bit of line 35 */
#define  EXTI_RTSR2_RT36                     ((uint32_t)0x00000010U)        /*!< Rising trigger event configuration bit of line 36 */
#define  EXTI_RTSR2_RT37                     ((uint32_t)0x00000020U)        /*!< Rising trigger event configuration bit of line 37 */
#define  EXTI_RTSR2_RT38                     ((uint32_t)0x00000040U)        /*!< Rising trigger event configuration bit of line 38 */

/******************  Bit definition for EXTI_FTSR2 register  ******************/
#define  EXTI_FTSR2_FT35                     ((uint32_t)0x00000008U)        /*!< Falling trigger event configuration bit of line 35 */
#define  EXTI_FTSR2_FT36                     ((uint32_t)0x00000010U)        /*!< Falling trigger event configuration bit of line 36 */
#define  EXTI_FTSR2_FT37                     ((uint32_t)0x00000020U)        /*!< Falling trigger event configuration bit of line 37 */
#define  EXTI_FTSR2_FT38                     ((uint32_t)0x00000040U)        /*!< Falling trigger event configuration bit of line 38 */

/******************  Bit definition for EXTI_SWIER2 register  *****************/
#define  EXTI_SWIER2_SWI35                   ((uint32_t)0x00000008U)        /*!< Software Interrupt on line 35 */
#define  EXTI_SWIER2_SWI36                   ((uint32_t)0x00000010U)        /*!< Software Interrupt on line 36 */
#define  EXTI_SWIER2_SWI37                   ((uint32_t)0x00000020U)        /*!< Software Interrupt on line 37 */
#define  EXTI_SWIER2_SWI38                   ((uint32_t)0x00000040U)        /*!< Software Interrupt on line 38 */

/*******************  Bit definition for EXTI_PR2 register  *******************/
#define  EXTI_PR2_PIF35                       ((uint32_t)0x00000008U)        /*!< Pending bit for line 35 */
#define  EXTI_PR2_PIF36                       ((uint32_t)0x00000010U)        /*!< Pending bit for line 36 */
#define  EXTI_PR2_PIF37                       ((uint32_t)0x00000020U)        /*!< Pending bit for line 37 */
#define  EXTI_PR2_PIF38                       ((uint32_t)0x00000040U)        /*!< Pending bit for line 38 */


/******************************************************************************/
/*                                                                            */
/*                                    FLASH                                   */
/*                                                                            */
/******************************************************************************/
/*******************  Bits definition for FLASH_ACR register  *****************/
#define FLASH_ACR_LATENCY                    ((uint32_t)0x00000007U)
#define FLASH_ACR_LATENCY_0WS                ((uint32_t)0x00000000U)
#define FLASH_ACR_LATENCY_1WS                ((uint32_t)0x00000001U)
#define FLASH_ACR_LATENCY_2WS                ((uint32_t)0x00000002U)
#define FLASH_ACR_LATENCY_3WS                ((uint32_t)0x00000003U)
#define FLASH_ACR_LATENCY_4WS                ((uint32_t)0x00000004U)
#define FLASH_ACR_PRFTEN                     ((uint32_t)0x00000100U)
#define FLASH_ACR_ICEN                       ((uint32_t)0x00000200U)
#define FLASH_ACR_DCEN                       ((uint32_t)0x00000400U)
#define FLASH_ACR_ICRST                      ((uint32_t)0x00000800U)
#define FLASH_ACR_DCRST                      ((uint32_t)0x00001000U)
#define FLASH_ACR_RUN_PD                     ((uint32_t)0x00002000U)   /*!< Flash power down mode during run */
#define FLASH_ACR_SLEEP_PD                   ((uint32_t)0x00004000U)   /*!< Flash power down mode during sleep */

/*******************  Bits definition for FLASH_SR register  ******************/
#define FLASH_SR_EOP                         ((uint32_t)0x00000001U)
#define FLASH_SR_OPERR                       ((uint32_t)0x00000002U)
#define FLASH_SR_PROGERR                     ((uint32_t)0x00000008U)
#define FLASH_SR_WRPERR                      ((uint32_t)0x00000010U)
#define FLASH_SR_PGAERR                      ((uint32_t)0x00000020U)
#define FLASH_SR_SIZERR                      ((uint32_t)0x00000040U)
#define FLASH_SR_PGSERR                      ((uint32_t)0x00000080U)
#define FLASH_SR_MISERR                      ((uint32_t)0x00000100U)
#define FLASH_SR_FASTERR                     ((uint32_t)0x00000200U)
#define FLASH_SR_RDERR                       ((uint32_t)0x00004000U)
#define FLASH_SR_OPTVERR                     ((uint32_t)0x00008000U)
#define FLASH_SR_BSY                         ((uint32_t)0x00010000U)

/*******************  Bits definition for FLASH_CR register  ******************/
#define FLASH_CR_PG                          ((uint32_t)0x00000001U)
#define FLASH_CR_PER                         ((uint32_t)0x00000002U)
#define FLASH_CR_MER1                        ((uint32_t)0x00000004U)
#define FLASH_CR_PNB                         ((uint32_t)0x000007F8U)
#define FLASH_CR_BKER                        ((uint32_t)0x00000800U)
#define FLASH_CR_MER2                        ((uint32_t)0x00008000U)
#define FLASH_CR_STRT                        ((uint32_t)0x00010000U)
#define FLASH_CR_OPTSTRT                     ((uint32_t)0x00020000U)
#define FLASH_CR_FSTPG                       ((uint32_t)0x00040000U)
#define FLASH_CR_EOPIE                       ((uint32_t)0x01000000U)
#define FLASH_CR_ERRIE                       ((uint32_t)0x02000000U)
#define FLASH_CR_RDERRIE                     ((uint32_t)0x04000000U)
#define FLASH_CR_OBL_LAUNCH                  ((uint32_t)0x08000000U)
#define FLASH_CR_OPTLOCK                     ((uint32_t)0x40000000U)
#define FLASH_CR_LOCK                        ((uint32_t)0x80000000U)

/*******************  Bits definition for FLASH_ECCR register  ***************/
#define FLASH_ECCR_ADDR_ECC                 ((uint32_t)0x0007FFFFU)
#define FLASH_ECCR_BK_ECC                   ((uint32_t)0x00080000U)
#define FLASH_ECCR_SYSF_ECC                 ((uint32_t)0x00100000U)
#define FLASH_ECCR_ECCIE                    ((uint32_t)0x01000000U)
#define FLASH_ECCR_ECCC                     ((uint32_t)0x40000000U)
#define FLASH_ECCR_ECCD                     ((uint32_t)0x80000000U)

/*******************  Bits definition for FLASH_OPTR register  ***************/
#define FLASH_OPTR_RDP                      ((uint32_t)0x000000FFU)
#define FLASH_OPTR_BOR_LEV                  ((uint32_t)0x00000700U)
#define FLASH_OPTR_BOR_LEV_0                ((uint32_t)0x00000000U)
#define FLASH_OPTR_BOR_LEV_1                ((uint32_t)0x00000100U)
#define FLASH_OPTR_BOR_LEV_2                ((uint32_t)0x00000200U)
#define FLASH_OPTR_BOR_LEV_3                ((uint32_t)0x00000300U)
#define FLASH_OPTR_BOR_LEV_4                ((uint32_t)0x00000400U)
#define FLASH_OPTR_nRST_STOP                ((uint32_t)0x00001000U)
#define FLASH_OPTR_nRST_STDBY               ((uint32_t)0x00002000U)
#define FLASH_OPTR_nRST_SHDW                ((uint32_t)0x00004000U)
#define FLASH_OPTR_IWDG_SW                  ((uint32_t)0x00010000U)
#define FLASH_OPTR_IWDG_STOP                ((uint32_t)0x00020000U)
#define FLASH_OPTR_IWDG_STDBY               ((uint32_t)0x00040000U)
#define FLASH_OPTR_WWDG_SW                  ((uint32_t)0x00080000U)
#define FLASH_OPTR_BFB2                     ((uint32_t)0x00100000U)
#define FLASH_OPTR_DUALBANK                 ((uint32_t)0x00200000U)
#define FLASH_OPTR_nBOOT1                   ((uint32_t)0x00800000U)
#define FLASH_OPTR_SRAM2_PE                 ((uint32_t)0x01000000U)
#define FLASH_OPTR_SRAM2_RST                ((uint32_t)0x02000000U)

/******************  Bits definition for FLASH_PCROP1SR register  **********/
#define FLASH_PCROP1SR_PCROP1_STRT          ((uint32_t)0x0000FFFFU)

/******************  Bits definition for FLASH_PCROP1ER register  ***********/
#define FLASH_PCROP1ER_PCROP1_END           ((uint32_t)0x0000FFFFU)
#define FLASH_PCROP1ER_PCROP_RDP            ((uint32_t)0x80000000U)

/******************  Bits definition for FLASH_WRP1AR register  ***************/
#define FLASH_WRP1AR_WRP1A_STRT             ((uint32_t)0x000000FFU)
#define FLASH_WRP1AR_WRP1A_END              ((uint32_t)0x00FF0000U)

/******************  Bits definition for FLASH_WRPB1R register  ***************/
#define FLASH_WRP1BR_WRP1B_STRT             ((uint32_t)0x000000FFU)
#define FLASH_WRP1BR_WRP1B_END              ((uint32_t)0x00FF0000U)

